#задание 4
# Входные данные (1-7, где 1 = понедельник)
day_number = 3
days = {
    1: "Понедельник",
    2: "Вторник",
    3: "Среда",
    4: "Четверг",
    5: "Пятница",
    6: "Суббота",
    7: "Воскресенье"
}

work_mode = {
    1: "10:00 - начало смены",
    2: "10:00 - начало смены",
    3: "10:00 - начало смены",
    4: "10:00 - начало смены",
    5: "10:00 - начало смены",
    6: "Отдых",
    7: "Отдых"
}

# Проверка и вывод
if 1 <= day_number <= 7:
    print("=== РАБОЧИЙ ГРАФИК ===")
    print(f"День: {days[day_number]}")
    print(f"Режим: {work_mode[day_number]}")
else:
    print("Ошибка: номер дня должен быть от 1 до 7")
